
  #Область ПрограммныйИнтерфейс  
  
  Процедура ДополнитьФорму (Форма) Экспорт  
	  
	  ИмяФормы = Форма.ИмяФормы;
	  
	  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" тогда
		  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		  ДобавитьПолеСогласованнаяСкидка(Форма);
		  ДобавитьКомандуПересчитатьСкидку(Форма);
	  ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" тогда
		  ВставитьПолеКонтактноеЛицоНаФорму(Форма);
	  ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" тогда  
		  ВставитьПолеКонтактноеЛицоНаФорму(Форма); 
	  ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" тогда  
		  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	  ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" тогда  
		  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	  КонецЕсли;	
	  
  КонецПроцедуры  
  
  #КонецОбласти     
  
  
  
  #Область СлужебныйПрограммныйИнтерфейс 
  Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	  
	  ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип ("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры
  
  Процедура ВставитьПолеКонтактноеЛицоНаФорму(Форма) Экспорт
	  
	  ПолеВвода = Форма.Элементы.Добавить ("КонтактноеЛицо", Тип("ПолеФормы"));
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры
  
  Процедура ДобавитьПолеСогласованнаяСкидка(Форма) Экспорт
	  
	  ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип ("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	  ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	  
  КонецПроцедуры	 
  
 Процедура ДобавитьКомандуПересчитатьСкидку(Форма) Экспорт
	
	    КомандаФормы  = Форма.Команды.Добавить("ПересчитатьСкидку");
        КомандаФормы.Действие = "ПересчетСоСкидкой";
        НовыйЭлемент = Форма.Элементы.Добавить("ПересчитатьСкидку",Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
        НовыйЭлемент.Заголовок = "Пересчитать";
        НовыйЭлемент.ИмяКоманды = "ПересчитатьСкидку";
		
КонецПроцедуры  

  
  #КонецОбласти 
  
  
